kuym/LPC11U24Gadget/main.cpp
#include <LPC11U00.h>
#include <LPC11U00API.h>
#include <USBAPI.h>
#include <USBCDC.h>
#include <string.h>
#include <stdlib.h>

#define MIN(a, b)	((a < b)? (a) : (b))

using namespace LPC11U00;

////////////////////////////////////////////////////////////////

static USBDescriptorDevice const __attribute__((aligned(4))) kDeviceDescriptor =
{
	.header					= {.size = sizeof(USBDescriptorDevice), .type = DescriptorType_Device},

	.usbSpecification		= 0x0200,
	.deviceClass			= 0x02,
	.subClass				= 0x00,
	.protocol				= 0x00,

	.endpoint0Size			= 64,

	.vendorID				= 0x80b1,
	.productID				= 0x1234,
	.releaseNumber			= 0x0101,

	.manufacturerStrIndex	= 0x01,
	.productStrIndex		= 0x02,
	.serialNumStrIndex		= 0x03,

	.numberOfConfigurations	= 0x01
};

struct __attribute__((packed)) CDCACMConfigurationDescriptor
{
	USBDescriptorConfigurationHeader	header;
	USBDescriptorInterface				interface0;
	CDCDescriptorFunctionalHeader		cdcFunctional0;
	CDCDescriptorFunctionalACM			cdcFunctionalACM;
	CDCDescriptorFunctionalHeader		cdcFunctional1;
	CDCDescriptorFunctionalUnion		cdcFunctionalUnion;
	USBDescriptorEndpoint				endpoint0_0;
	USBDescriptorInterface				interface1;
	USBDescriptorEndpoint				endpoint1_0;
	USBDescriptorEndpoint				endpoint1_1;

	unsigned char						_sentinel;

} const kCDCACMConfigurationDescriptor __attribute__((aligned(4))) =
{
	.header =
	{
		.header = {.size = sizeof(USBDescriptorConfigurationHeader), .type = DescriptorType_Configuration},

		.totalConfigurationSize = sizeof(CDCACMConfigurationDescriptor) - 1,
		.totalInterfaces		= 2,
		.configurationNumber	= 1,
		.configurationStrIndex	= 0,
		.configAttributes		= (0x80),
		.maxPowerConsumption	= (100 / 2),
	},
	.interface0 =
	{
		.header = {.size = sizeof(USBDescriptorInterface), .type = DescriptorType_Interface},
		.interfaceNumber	= 0,
		.alternateSetting	= 0,
		.totalEndpoints		= 1,
		.interfaceClass		= 2,
		.subClass			= 2,
		.protocol			= 1,
		.interfaceStrIndex	= 0,
	},
	.cdcFunctional0 =
	{
		.header = {.size = sizeof(CDCDescriptorFunctionalHeader), .type = DescriptorType_CSInterface},
		.subType = 0,
		.cdcSpecification = 0x0110
	},
	.cdcFunctionalACM =
	{
		.header = {.size = sizeof(CDCDescriptorFunctionalACM), .type = DescriptorType_CSInterface},
		.subType = 0x02,
		.capabilities = 0x02
	},
	.cdcFunctional1 =
	{
		.header = {.size = sizeof(CDCDescriptorFunctionalHeader), .type = DescriptorType_CSInterface},
		.subType = 0x06,
		.cdcSpecification = 0x0100
	},
	.cdcFunctionalUnion =
	{
		.header = {.size = sizeof(CDCDescriptorFunctionalUnion), .type = DescriptorType_CSInterface},
		.subType = 0x01,
		.masterInterfaceNumber = 0x00,
		.slaveInterfaceNumber = 0x01
	},
	.endpoint0_0 =
	{
		.header = {.size = sizeof(USBDescriptorEndpoint), .type = DescriptorType_Endpoint},
		.endpointAddress	= 0x82,
		.attributes			= (USBEndpointType_Interrupt | USBEndpointAttribute_NoSync | USBEndpointUsage_Data),
		.endpointSize		= 8,
		.pollingIntervalMS	= 2,
	},
	
	.interface1 =
	{
		.header = {.size = sizeof(USBDescriptorInterface), .type = DescriptorType_Interface},
		.interfaceNumber	= 1,
		.alternateSetting	= 0,
		.totalEndpoints		= 2,
		.interfaceClass		= 10,
		.subClass			= 0,
		.protocol			= 0,
		.interfaceStrIndex	= 0,
	},
	.endpoint1_0 =
	{
		.header = {.size = sizeof(USBDescriptorEndpoint), .type = DescriptorType_Endpoint},
		.endpointAddress	= 0x03,
		.attributes			= (USBEndpointType_Bulk | USBEndpointAttribute_NoSync | USBEndpointUsage_Data),
		.endpointSize		= 64,
		.pollingIntervalMS	= 0,
	},
	.endpoint1_1 =
	{
		.header = {.size = sizeof(USBDescriptorEndpoint), .type = DescriptorType_Endpoint},
		.endpointAddress	= 0x83,
		.attributes			= (USBEndpointType_Bulk | USBEndpointAttribute_NoSync | USBEndpointUsage_Data),
		.endpointSize		= 64,
		.pollingIntervalMS	= 0,
	},
	._sentinel = 0
};


static unsigned char const __attribute__((aligned(4))) kUSBStrings[] =
	"\x04\x03" "\x09\x04"
	"\x12\x03" "W\0" "h\0" "o\0" "m\0" "e\0" "v\0" "e\0" "r\0"
	"\x0E\x03" "G\0" "a\0" "d\0" "g\0" "e\0" "t\0"
	"\x0A\x03" "1\0" "2\0" "3\0" "4\0"
	;


extern "C" void		USB_IRQHandler(void)
{
	USB::Interrupt();
}

void	onI2CCompletion(int id, unsigned char* p, unsigned int len, void* context);
void	onI2CMonitor(int address, unsigned char* p, unsigned int len, void* context);

int main(void)
{
	__asm__ volatile ("cpsid i"::);

	*ClockControl = (ClockControl_Core | ClockControl_ROM | ClockControl_RAM
		| ClockControl_FlashRegisters | ClockControl_FlashStorage | ClockControl_GPIO
		| ClockControl_IOConfig);

	*IOConfigPIO0_3 = (*IOConfigPIO0_3 & ~IOConfigPIO_FunctionMask) | IOConfigPIO0_3_Function_PIO;

	System::setClockOutput();	//output the core clock

	//Set up PLL to 48MHz, USB PLL to 48MHz also
	System::setupSystemPLL();
	delay(5);	//stabilize

	UART::start(57600, UART::Default);

	System::setupUSBPLL();

	//USB setup
	USB::Init();

	USB::SetDescriptor((unsigned char const*)&kDeviceDescriptor, sizeof(kDeviceDescriptor));
	USB::SetDescriptor((unsigned char const*)&kCDCACMConfigurationDescriptor, sizeof(kCDCACMConfigurationDescriptor));
	USB::SetDescriptor((unsigned char const*)&kUSBStrings, sizeof(kUSBStrings));

	USBCDCDevice cdcDevice(256, 256);

	USB::RegisterHandler((unsigned char const*)&kCDCACMConfigurationDescriptor, &USBCDCDevice::usbCDCACMHandler, &cdcDevice);
	USB::RegisterHandler((unsigned char const*)&kCDCACMConfigurationDescriptor.endpoint1_0, &USBCDCDevice::usbCDCACMHandler, &cdcDevice);
	USB::RegisterHandler((unsigned char const*)&kCDCACMConfigurationDescriptor.endpoint1_1, &USBCDCDevice::usbCDCACMHandler, &cdcDevice);

	ErrorCode error = USB::Start();
	if(error != ErrorCode_OK)
	{
		UART::writeSync("\nStart() error: ");
		UART::writeSync(error, NumberFormatter::Hexadecimal);
	}

	interruptsEnabled();
	
	USB::Connect();
	UART::writeSync("\nConnected");

	bool reset = true;
	unsigned char* i2cCommandBuffer = new unsigned char[256];
	unsigned int i2cCommandIndex = 0, i2cCommandParseState = 0, i2cLength = 0;

	//I2C::monitor(256, &onI2CMonitor, (void*)&cdcDevice);
	
	while(true)
	{
		//__asm__ volatile ("wfi"::);
		//UART::writeSync("\nalive.");
		//delay(1000);
		
		//USB::Write(0x83, (unsigned char*)"hello :-)\n", 10);

		/*int length = cdcDeviceState.buffer.used();
		if(cdcDeviceState.connected && (length > 0))
		{
			length = (length > 10)? 10 : length;
			unsigned char miniBuffer[10];

			cdcDeviceState.buffer.read(miniBuffer, length);

			// if we couldn't accept another [endpoint size] bytes, stall the pipe
			if(cdcDeviceState.buffer.free() >= 64)
				USB::SetStall(0x03, false);

			USB::Write(0x83, miniBuffer, length);
		}
		*/

		
		if(cdcDevice.connected())
		{
			int length;
			while((length = cdcDevice.bytesAvailable()) > 0)
			{
				if(reset)
				{
					I2C::start(100000);

					i2cCommandIndex = 0;
					i2cCommandParseState = 0;
					i2cLength = 0;
					reset = false;
				}

				unsigned int bytesRead = cdcDevice.read(i2cCommandBuffer + i2cCommandIndex, 256 - i2cCommandIndex);

				if(bytesRead > 0)
				{
					// parse command(s)
					unsigned int end = i2cCommandIndex + bytesRead, available = 0;
					while(i2cCommandIndex < end)
					{
						switch(i2cCommandParseState)
						{
						case 0:
							i2cCommandIndex++;
							i2cCommandParseState++;
							break;

						case 1:
							i2cLength = i2cCommandBuffer[i2cCommandIndex++];

							if(i2cCommandBuffer[0] & 1)
							{
								I2C::write(i2cCommandBuffer[0], 0, i2cLength, &onI2CCompletion, (void*)&cdcDevice);
								goto advance;
							}
							else
								i2cCommandParseState++;
							//(intentional)
						case 2:
							available = MIN(end - i2cCommandIndex, i2cLength);
							i2cCommandIndex += available;
							i2cLength -= available;
							if(i2cLength == 0)
							{
								I2C::write(i2cCommandBuffer[0], i2cCommandBuffer + 2, i2cCommandBuffer[1], &onI2CCompletion, (void*)&cdcDevice);
								goto advance;
							}
							break;

						advance:
							memcpy(i2cCommandBuffer, i2cCommandBuffer + i2cCommandIndex, end - i2cCommandIndex);
							end -= i2cCommandIndex;
							i2cCommandParseState = 0;
							i2cCommandIndex = 0;
							break;
						}
					}
				}
			}
		}
		else
		{
			if(!reset)
			{
				I2C::stop();
				reset = true;
			}
		}
		__asm__ volatile ("wfi"::);
	}
}

void	onI2CCompletion(int id, unsigned char* p, unsigned int len, void* context)
{
	USBCDCDevice* cdcDevice = (USBCDCDevice*)context;

	unsigned char* buffer = (unsigned char*)alloca(2 + (p? len : 0));
	buffer[0] = (unsigned char)id;
	buffer[1] = (unsigned char)len;
	if(p)
		memcpy(buffer + 2, p, len);
	
	cdcDevice->write(buffer, 2 + (p? len : 0));
}

void	onI2CMonitor(int address, unsigned char* p, unsigned int len, void* context)
{
	USBCDCDevice* cdcDevice = (USBCDCDevice*)context;

	unsigned char* buffer = (unsigned char*)alloca(2 + (p? len : 0));
	buffer[0] = (unsigned char)address;
	buffer[1] = (unsigned char)len;
	if(p)
		memcpy(buffer + 2, p, len);
	
	cdcDevice->write(buffer, 2 + (p? len : 0));
}

